import json

data = {
    "Іваненко": ["Іван", "Іванович", 2000],
    "Петренко": ["Петро", "Петрович", 1999],
    "Сидоренко": ["Сидір", "Сидорович", 2001],
    "Коваленко": ["Олег", "Олегович", 2002],
    "Шевченко": ["Тарас", "Григорович", 1998],
    "Бондаренко": ["Анна", "Іванівна", 2000],
    "Мельник": ["Марія", "Петрівна", 2003],
    "Ткаченко": ["Оксана", "Олексіївна", 2001],
    "Кравченко": ["Андрій", "Сергійович", 1997],
    "Лисенко": ["Юрій", "Миколайович", 2002]
}

def main():
    # запис
    with open("data.json", "w", encoding="utf-8") as f:
        json.dump(data, f, ensure_ascii=False, indent=4)

    # читання
    with open("data.json", "r", encoding="utf-8") as f:
        loaded = json.load(f)

    print("\nДані з JSON:\n")
    for surname, info in loaded.items():
        print(f"{surname}: {info}")


if __name__ == "__main__":
    main()